{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.2.2", "config": [{"class_name": "Dense", "config": {"activation": "relu", "kernel_regularizer": null, "name": "dense_1", "batch_input_shape": [null, 784], "units": 512, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}}}, {"class_name": "Dense", "config": {"activation": "relu", "kernel_regularizer": null, "name": "dense_2", "batch_input_shape": [null, 512], "units": 128, "dtype": "float32", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}}}, {"class_name": "Dense", "config": {"activation": "softmax", "use_bias": true, "name": "dense_3", "activity_regularizer": null, "units": 10, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "RandomNormal", "config": {"seed": null, "mean": 0.0, "stddev": 0.05}}}}]}