{"config": [{"config": {"filters": 6, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "conv2d_1", "activation": "sigmoid", "bias_regularizer": null, "dtype": "float32", "use_bias": true, "strides": [1, 1], "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "padding": "valid", "dilation_rate": [1, 1], "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_1", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"filters": 16, "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "name": "conv2d_2", "activation": "sigmoid", "kernel_constraint": null, "bias_regularizer": null, "padding": "valid", "strides": [1, 1], "data_format": "channels_last", "trainable": true, "activity_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "pool_size": [2, 2], "data_format": "channels_last", "trainable": true, "name": "average_pooling2d_2", "strides": [2, 2]}, "class_name": "AveragePooling2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"kernel_constraint": null, "units": 120, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_1", "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 84, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_2", "activation": "sigmoid", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"kernel_constraint": null, "units": 10, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "name": "dense_3", "activation": "softmax", "use_bias": true, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_constraint": null, "kernel_regularizer": null}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}