{"keras_version": "2.2.2", "config": [{"config": {"activity_regularizer": null, "dtype": "float32", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_regularizer": null, "padding": "same", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "batch_input_shape": [null, 224, 224, 1], "strides": [1, 1], "trainable": true, "name": "conv2d_1", "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_2", "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_3", "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_4", "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_5", "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_6", "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_7", "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_8", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_9", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_10", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_11", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_12", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "dilation_rate": [1, 1], "use_bias": true, "strides": [1, 1], "padding": "same", "name": "conv2d_13", "filters": 512, "kernel_regularizer": null, "data_format": "channels_last", "kernel_constraint": null, "bias_constraint": null}, "class_name": "Conv2D"}, {"config": {"strides": [2, 2], "data_format": "channels_last", "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2], "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"activity_regularizer": null, "activation": "relu", "units": 256, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_1", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "relu", "units": 128, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_2", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}, {"config": {"trainable": true, "seed": null, "name": "dropout_2", "rate": 0.5, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activity_regularizer": null, "activation": "softmax", "units": 10, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "name": "dense_3", "kernel_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential"}