{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 6, "dtype": "float32", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, 28, 28, 1], "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "name": "conv2d_1", "dilation_rate": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_size": [5, 5]}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "average_pooling2d_1", "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "filters": 16, "name": "conv2d_2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "padding": "valid", "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid", "kernel_size": [5, 5]}}, {"class_name": "AveragePooling2D", "config": {"strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid", "name": "average_pooling2d_2", "trainable": true}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"units": 120, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 84, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}}, "use_bias": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.2.2"}